Locked-Inc/STAR/star-rx72n-firmware/src/main.c
/* Multi-task architecture includes */
#include "comm_task.h"
#include "imu_task.h"
#include "led_status_task.h"
#include "motor_control_task.h"
#include "obstacle_detect_task.h"
#include "serial_bringup_task.h"
#include "shared_data.h"
#include "telemetry_task.h"
#include "temp_sensor_task.h"
#include "usb_task.h"
#include "watchdog_monitor_task.h"

/* Watchdog driver */
#include "rx_iwdt.h"

/* Stack overflow detection */
#include "rx_stack_monitor.h"

/* =============================================================================
 * Main Return Codes
 * =============================================================================
 */

/**
 * @brief Main function return codes
 *
 * Note: main() should never return in this firmware as ThreadX takes over.
 * These codes exist for completeness and static analysis tools.
 */
typedef enum : uint8_t {
  k_main_ret_success = 0, /**< Successful completion (should never be reached) */
} main_ret_t;

/* =============================================================================
 * Hardware Configuration Constants
 * =============================================================================
 */

/**
 * @brief RIIC (I2C) channel number constants for RX72N
 * @details
 * RX72N has 3 RIIC channels (0-2). These constants are used with uint8_t
 * parameters in bus configuration functions.
 *
 * @note hardware.h defines riic_channel_t as a struct wrapper, but bus
 *       configuration functions use raw uint8_t for channel numbers.
 *
 * @see rx_bus_config_init_i2c() Uses uint8_t channel parameter
 */
typedef enum : uint8_t {
  k_riic_channel_0 = 0, /**< RIIC channel 0 */
  k_riic_channel_1 = 1, /**< RIIC channel 1 */
  k_riic_channel_2 = 2, /**< RIIC channel 2 */
} riic_channel_num_t;

/**
 * @brief Standard I2C bus frequencies for RIIC configuration
 * @details
 * Standard I2C frequency constants for bus configuration.
 * Values in Hz for clarity and type safety.
 *
 * @see rx_bus_config_init_i2c() Uses frequency_hz parameter
 */
typedef enum : uint32_t {
  k_i2c_frequency_100khz = 100000, /**< Standard mode: 100 kHz (default) */
  k_i2c_frequency_400khz = 400000, /**< Fast mode: 400 kHz */
} i2c_frequency_t;

/**
 * @brief I2C device addresses for IMU sensors on RIIC1 bus
 * @details
 * Both IMU sensors share the RIIC1 bus (P2.0=SDA1, P2.1=SCL1) but
 * are distinguished by their 7-bit I2C addresses:
 * - BNO055 COM3/ADR pin LOW: 0x28
 * - BMP280 SDO pin LOW:      0x76
 *
 * @invariant Values are 7-bit I2C addresses (range 0x00..0x7F) on RIIC1;
 *            k_i2c_addr_bno055 and k_i2c_addr_bmp280 must be distinct
 *
 * @see internal_register_system_buses() Uses these addresses with rx_bus_config_init_i2c()
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_i2c_addr_bno055 = 0x28U, /**< BNO055 I2C address when COM3/ADR pin = LOW */
  k_i2c_addr_bmp280 = 0x76U, /**< BMP280 I2C address when SDO pin = LOW */
  k_i2c_addr_mpu6050 =
    0x68U, /**< GY-521 / MPU-6050 default address (AD0=LOW) -- bench-test probe */
} imu_i2c_addr_t;
static_assert(sizeof(imu_i2c_addr_t) == sizeof(uint8_t), "imu_i2c_addr_t must be uint8_t sized");
static_assert(k_i2c_addr_bno055 != k_i2c_addr_bmp280,
              "k_i2c_addr_bno055 and k_i2c_addr_bmp280 must be distinct");
static_assert(k_i2c_addr_mpu6050 != k_i2c_addr_bno055 && k_i2c_addr_mpu6050 != k_i2c_addr_bmp280,
              "k_i2c_addr_mpu6050 must be distinct from other RIIC1 addresses");

/* =============================================================================
 * Static Bus Configurations
 * =============================================================================
 */

/**
 * @var s_onewire0_config
 * @brief 1-Wire configuration for DS18B20 temperature sensor
 *
 * @details
 * Configures GPIO P51 as 1-Wire interface for DS18B20 digital temperature sensor.
 * Uses bit-banging protocol with precise timing requirements.
 *
 * **Hardware Configuration:**
 * - Bus type: 1-Wire (Dallas/Maxim protocol)
 * - Pin: P51 (bidirectional data line)
 * - Pullup: 4.7 kOhm resistor required (external)
 * - Protocol: Bit-banging with microsecond timing
 *
 * **Device Details:**
 * The DS18B20 is a digital temperature sensor providing:
 * - Temperature range: -55degC to +125degC
 * - Accuracy: +/-0.5degC (-10degC to +85degC)
 * - Resolution: 9 to 12 bits (configurable)
 * - Conversion time: 750 ms max (12-bit resolution)
 * - Unique 64-bit serial number per device
 *
 * @note Static allocation follows NASA Power of 10 Rule 3 (no dynamic memory).
 * @note Registered with bus manager in tx_application_define() before task creation.
 * @note Requires 4.7 kOhm pullup resistor on P51 (see schematic).
 * @note 1-Wire protocol timing is critical - interrupts may cause timing violations.
 *
 * @see rx_bus_config_init_onewire() Bus configuration function
 * @see temp_sensor_task.c Task that uses this bus for temperature monitoring
 *
 * @since Version 1.0.0
 */
/** @brief Log tags for this translation unit (project convention: variables, not string literals) */
[[maybe_unused]] static const char* const s_tag         = "MAIN";
static const char* const                  s_boot_tag    = "BOOT";
static const char* const                  s_mpu6050_tag = "MPU6050";

static rx_bus_config_t s_onewire0_config;

/**
 * @var s_gpio_config
 * @brief Generic GPIO bus configuration for motor driver control
 *
 * @details
 * Configures a generic GPIO bus abstraction that provides access to all GPIO pins.
 * The initial pin (P00) is required by the API but not significant - motor control
 * task specifies actual pins (nFAULT, chip selects, etc.) at runtime.
 *
 * **Hardware Configuration:**
 * - Bus type: GPIO (generic abstraction)
 * - Initial pin: P00 (API requirement, not actually used)
 * - Actual pins: Specified by motor_control_task at runtime
 *
 * **Usage Pattern:**
 * Motor control task uses this generic GPIO bus to access:
 * - Motor nFAULT pins (fault detection)
 * - Motor enable/disable control pins
 * - LED status indicators
 *
 * The pin validator ensures no physical pins are double-allocated.
 *
 * @note Static allocation follows NASA Power of 10 Rule 3 (no dynamic memory).
 * @note Registered with bus manager in tx_application_define() before task creation.
 * @note This is a generic bus abstraction - one "gpio" bus serves all 4 motor drivers.
 * @note Each driver operation specifies the actual pin to access.
 *
 * @see rx_bus_config_init_gpio() Bus configuration function
 * @see motor_control_task.c Task that uses this bus for motor control
 * @see rx_bus_gpio_write() Runtime GPIO write with pin specification
 * @see rx_bus_gpio_read() Runtime GPIO read with pin specification
 *
 * @since Version 1.0.0
 */
static rx_bus_config_t s_gpio_config;

/**
 * @enum motor_current_adc_count_t
 * @brief Number of motor current-sense ADC channels
 *
 * @details
 * One ADC channel per motor (S12AD0 channels 4-7). Matches the physical
 * number of DRV8263H IPROPI outputs wired to the RX72N ADC.
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_motor_current_adc_count = 4U, /**< 4 motors -> 4 current-sense channels */
} motor_current_adc_count_t;

/**
 * @var k_motor_current_adc_channels
 * @brief S12AD0 channel for each motor current-sense input, indexed by motor index
 *
 * @details
 * Maps motor index (0-3) to its S12AD0 channel. Bus names are obtained from
 * g_motor_current_bus_names (declared in motor_control_task.h) so there is a
 * single authoritative name table shared between bus registration here and
 * ADC reads in motor_control_task.c.
 *
 * | Index | Motor | Channel | Pin |
 * |-------|-------|---------|-----|
 * | 0     | FL    | AN007   | P47 |
 * | 1     | FR    | AN006   | P46 |
 * | 2     | BL    | AN005   | P45 |
 * | 3     | BR    | AN004   | P44 |
 *
 * @warning Array size must match k_motor_current_adc_count.
 * @see g_motor_current_bus_names Shared bus name array (motor_control_task.h)
 * @see internal_register_system_buses() Iterates over this table
 * @since Version 1.0.0
 */
static const adc_channel_t k_motor_current_adc_channels[k_motor_current_adc_count] = {
  k_adc_channel_7, /* Motor 0 (FL): AN007, P47 */
  k_adc_channel_6, /* Motor 1 (FR): AN006, P46 */
  k_adc_channel_5, /* Motor 2 (BL): AN005, P45 */
  k_adc_channel_4, /* Motor 3 (BR): AN004, P44 */
};

/**
 * @var s_motor_current_configs
 * @brief ADC bus configuration storage for all four motor current-sense channels
 *
 * @details
 * Provides static storage for the four rx_bus_config_t structs populated by
 * internal_register_system_buses() via rx_bus_config_init_adc(). Using an
 * array eliminates four separate per-motor variables while retaining the same
 * lifetime and BSS-zero initialisation guarantees.
 *
 * @note Static allocation follows NASA Power of 10 Rule 3 (no dynamic memory).
 * @see k_motor_current_adc_channels Channel table supplying S12AD0 channel per motor
 * @see rx_bus_config_init_adc() Bus configuration function
 * @see motor_control_task.c internal_update_motor_state() Consumer
 * @since Version 1.0.0
 */
static rx_bus_config_t s_motor_current_configs[k_motor_current_adc_count];

/**
 * @var s_i2c1_imu_config
 * @brief I2C bus configuration for BNO055 IMU sensor on RIIC1
 *
 * @details
 * Configures the RIIC1 I2C bus for the BNO055 9-DOF orientation sensor.
 *
 * **Hardware Configuration:**
 * - Bus type: I2C (RIIC1 peripheral)
 * - Channel: 1 (RIIC1)
 * - Device address: 0x28 (BNO055, COM3/ADR=LOW)
 * - SDA: P2.0 (SDA1)
 * - SCL: P2.1 (SCL1)
 * - Frequency: 400 kHz (fast mode)
 *
 * @pre RIIC1 hardware initialized before any driver uses this config
 * @post rx_bus_config_init_i2c() populates all fields before bus registration
 *
 * @note Bus name "i2c1_imu" matches s_bus_name in rx_bno055.c
 * @note Static allocation follows NASA Power of 10 Rule 3
 *
 * @see rx_bno055.h BNO055 driver that uses this bus
 *
 * @since Version 1.0.0
 */
static rx_bus_config_t s_i2c1_imu_config;

/**
 * @var s_i2c1_baro_config
 * @brief I2C bus configuration for BMP280 barometric sensor on RIIC1
 *
 * @details
 * Configures the RIIC1 I2C bus for the BMP280 barometric pressure sensor.
 * Shares RIIC1 hardware with the BNO055 but uses a separate bus name and
 * device address.
 *
 * **Hardware Configuration:**
 * - Bus type: I2C (RIIC1 peripheral)
 * - Channel: 1 (RIIC1)
 * - Device address: 0x76 (BMP280, SDO=LOW)
 * - SDA: P2.0 (SDA1)
 * - SCL: P2.1 (SCL1)
 * - Frequency: 400 kHz (fast mode)
 *
 * @pre RIIC1 hardware initialized before any driver uses this config
 * @post rx_bus_config_init_i2c() populates all fields before bus registration
 *
 * @note Bus name "i2c1_baro" matches s_bus_name in rx_bmp280.c
 * @note Static allocation follows NASA Power of 10 Rule 3
 *
 * @see rx_bmp280.h BMP280 driver that uses this bus
 *
 * @since Version 1.0.0
 */
static rx_bus_config_t s_i2c1_baro_config;

