Locked-Inc/STAR/star-rx72n-firmware/src/main.c
/** @brief Bench-test I2C bus config for a GY-521 / MPU-6050 at 0x68 on RIIC1. */
static rx_bus_config_t s_i2c1_mpu_config;

/* =============================================================================
 * Bench probe: write {magic, who_am_i, err} to data flash @ 0x00100000 so that
 * rfp-cli -rv 0x00100000 16 can read the result without a UART. No dependency
 * on rx_hal flash driver -- hand-rolled FCU sequence per RX72N HW manual Ch 62.
 * ========================================================================= */
static void internal_bench_dflash_write(uint8_t who_am_i, int32_t err)
{
  volatile uint32_t* const FSTATR  = (volatile uint32_t*)0x007FE080U;
  volatile uint16_t* const FENTRYR = (volatile uint16_t*)0x007FE084U;
  volatile uint32_t* const FSADDR  = (volatile uint32_t*)0x007FE030U;
  volatile uint16_t* const FPCKAR  = (volatile uint16_t*)0x007FE0E4U;
  volatile uint8_t* const  FWEPROR = (volatile uint8_t*)0x0008C296U;
  volatile uint8_t* const  FACI_B  = (volatile uint8_t*)0x007E0000U;
  volatile uint16_t* const FACI_W  = (volatile uint16_t*)0x007E0000U;
  const uint32_t           DF_ADDR = 0x00100000U;

  /* Enable P/E operations. */
  *FWEPROR = 0x01U;

  /* Notify FCU of FCLK = 60 MHz (key 0x1E00 | freq_in_MHz). Must be done
   * BEFORE entering P/E mode or FCU silently rejects every command. */
  *FPCKAR = (uint16_t)(0x1E00U | 60U);

  /* Enter data flash P/E mode. */
  *FENTRYR = 0xAA80U;
  /* Spin until data-flash P/E mode is active (FENTRYR low byte = 0x80). */
  for (uint32_t i = 0; i < 100000U && (*FENTRYR & 0x00FFU) != 0x80U; i++) {
  }
  /* Wait for FRDY. */
  for (uint32_t i = 0; i < 100000U && ((*FSTATR) & (1UL << 15)) == 0U; i++) {
  }

  /* Erase the 64-byte block containing DF_ADDR. */
  *FSADDR = DF_ADDR;
  *FACI_B = 0x20U; /* block erase */
  *FACI_B = 0xD0U; /* terminator */
  for (uint32_t i = 0; i < 1000000U && ((*FSTATR) & (1UL << 15)) == 0U; i++) {
  }

  /* Program 4 bytes: [0xA5, 0x5A, who_am_i, err_byte_low]. */
  const uint8_t  err_byte = (err == 0) ? 0x00U : (uint8_t)(err & 0xFFU);
  const uint16_t word0    = (uint16_t)((0x5AU << 8) | 0xA5U); /* LE: bytes 0=A5, 1=5A */
  const uint16_t word1 = (uint16_t)(((uint16_t)err_byte << 8) | who_am_i); /* LE: 2=who, 3=err    */

  *FSADDR = DF_ADDR;
  *FACI_B = 0xE8U; /* program */
  *FACI_B = 0x02U; /* N = 2 x 16-bit words (= 4 bytes) */
  *FACI_W = word0;
  *FACI_W = word1;
  *FACI_B = 0xD0U; /* terminator */
  for (uint32_t i = 0; i < 1000000U && ((*FSTATR) & (1UL << 15)) == 0U; i++) {
  }

  /* Exit P/E mode. */
  *FENTRYR = 0xAA00U;
  for (uint32_t i = 0; i < 100000U && (*FENTRYR & 0x00FFU) != 0x00U; i++) {
  }
}

/* =============================================================================
 * Startup Flag Check Helpers
 * =============================================================================
 */

/**
 * @brief Check Power-On Reset Detect Flag (PORF) in RSTSR0 register
 *
 * @details
 * Reads the **RSTSR0 register** to determine if the current boot was initiated by a
 * **power-on reset** (fresh power application, not warm boot or software reset).
 *
 * ## PORF (Power-On Reset Flag) Semantics
 *
 * | PORF Value | Meaning | Boot Type | Expected? |
 * |------------|---------|-----------|-----------|
 * | **1 (set)** | Power-on reset occurred | **Cold start** | [OK] on fresh boot |
 * | **0 (clear)** | No power-on reset | **Warm start** | [WARN] Software reset, watchdog, or debugger |
 *
 * ## Register Details
 *
 * **RSTSR0 (Reset Status Register 0):**
 * - **Address:** 0x000C001C (accessed via `rstsr01()->rstsr0`)
 * - **Bit 0 (PORF):** Power-On Reset Detect Flag
 *   - Set by hardware on VCC power-on
 *   - Cleared by software write (requires PRCR.PRC0=1 protection unlock)
 *   - Persistent across warm boots until explicitly cleared
 *
 * ## Use Cases and Interpretation
 *
 * **Cold start (PORF=1):**
 * - Expected on normal power-up
 * - Flash memory state unknown (may contain prior data)
 * - All peripherals reset to default state
 * - Typical after power connection, power cycle
 *
 * **Warm start (PORF=0):**
 * - Software reset (via SWRR register write)
 * - Watchdog timeout reset (WDT or IWDT)
 * - Debugger-initiated reset (OpenOCD, GDB)
 * - Voltage monitoring reset (LVD)
 *
 * **Key insight:** PORF=0 is **not an error** - it's informational. Many valid scenarios
 * produce warm boots (bootloader software reset, debugger attach, etc.).
 *
 * ## Performance (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | Register read (rstsr0) | ~0.5 us | Single 8-bit read |
 * | Bit masking (& k_rstsr0_porf) | ~5 cycles | Bitwise AND |
 * | Conditional logging | ~5 us | If warm boot detected (UART output) |
 * | **Total** | **~0.5 us** | No logging (cold start) |
 *
 * @return bool Power-on reset detection status
 * @retval true PORF is set (cold start - power-on reset occurred)
 * @retval false PORF is clear (warm start - no power-on reset)
 *
 * @pre RSTSR0 register accessible (memory-mapped I/O at valid address)
 * @pre Register pointer (rstsr01()) returns non-NULL compile-time constant
 *
 * @post Return value reflects actual PORF bit state
 * @post Warm boot logged if PORF=0 (informational message)
 *
 * @note **Does not modify RSTSR0.** Flag clearing requires protection unlock (PRCR.PRC0=1)
 *       and explicit write to RSTSR0. This function is read-only.
 *
 * @note **Both return values are acceptable.** This check is informational, not a pass/fail test.
 *       Warm boots (PORF=0) are valid in many scenarios (debugger, bootloader, etc.).
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context). No race conditions.
 *
 * @par Example Usage:
 * @code
 * // Check boot type
 * bool cold_start = internal_check_porf();
 * if (cold_start) {
 *   rx_log_info(s_tag, "Cold start detected (power-on reset)");
 * } else {
 *   rx_log_info(s_tag, "Warm start detected (software/watchdog reset)");
 * }
 * @endcode
 *
 * @see internal_check_startup_flags() Orchestrates all reset flag checks
 * @see internal_check_cwsf() Complementary cold/warm start determination (RSTSR1.7)
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify cold start (PORF=1) and warm start (PORF=0) detection
 */
static bool internal_check_porf(void)
{
  const volatile rx_rstsr01_regs_t* regs = rstsr01();

  /* Precondition: Register pointer must be valid (compile-time constant address) */
  RX_ASSERT(regs != nullptr, "RSTSR01 register pointer is nullptr");

  const uint8_t rstsr0_val = regs->rstsr0;

  /* PORF=1 indicates power-on reset occurred, which is expected on normal startup */
  const bool porf_set = (rstsr0_val & k_rstsr0_porf) != 0;

