Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  if (rstsr2_val & k_rstsr2_swrf) {
    rx_log_info(s_boot_tag, "Software reset detected (SWRF=1)");
    rx_log_info(s_boot_tag, "  -> May be intentional (bootloader, firmware update, debug)");
  }

  if (rstsr0_val & k_rstsr0_lvd0rf) {
    rx_log_warn(s_boot_tag, "Brownout reset detected (LVD0RF=1)");
    rx_log_warn(s_boot_tag, "  -> VCC dropped below threshold - Check power supply!");
  }

  /* Note: IWDTRF not reported here - if set, system halts in internal_check_startup_flags() */
}

/**
 * @brief Validate all reset status flags to detect abnormal boot conditions
 *
 * @details
 * Orchestrates **six reset status register checks** to detect abnormal reset conditions
 * (watchdog timeout, brownout, software reset, etc.). Implements a **fail-fast strategy**
 * for critical flags (IWDTRF) while logging non-critical warnings.
 *
 * ## Checked Reset Flags (RX72N Status Registers)
 *
 * | Flag | Register | Check Function | Critical? | Failure Action |
 * |------|----------|----------------|-----------|----------------|
 * | **PORF** | RSTSR0.0 | internal_check_porf() | No | Log info (warm boot OK) |
 * | **IWDTRF** | RSTSR2.1 | internal_check_iwdtrf() | **YES** | **Assert halts** |
 * | **WDTRF** | RSTSR2.0 | internal_check_wdtrf() | No | Return k_rx_err_hw_init_failed |
 * | **SWRF** | RSTSR2.2 | internal_check_swrf() | No | Return k_rx_err_hw_init_failed |
 * | **LVD0RF** | RSTSR0.1 | internal_check_lvd0rf() | No | Return k_rx_err_hw_init_failed |
 * | **CWSF** | RSTSR1.7 | internal_check_cwsf() | No | Informational only |
 *
 * ## Critical vs Non-Critical Error Handling
 *
 * **Critical errors (RX_ASSERT):**
 * - **IWDTRF set:** Independent Watchdog Timer timeout detected
 *   - **Root cause:** Prior firmware execution hung, deadlocked, or infinite loop
 *   - **Action:** Assert halts execution immediately (fail-fast)
 *   - **Rationale:** IWDT timeout is ALWAYS a firmware bug (missing tx_thread_sleep, runaway loop)
 *
 * **Non-critical errors (return error code):**
 * - **WDTRF/SWRF/LVD0RF set:** Unexpected but potentially recoverable conditions
 *   - **Action:** Log warning, return k_rx_err_hw_init_failed
 *   - **Rationale:** May be intentional (software reset for bootloader, brownout on power glitch)
 *
 * ## Execution Flow
 *
 * @msc
 * msc {
 *   width=600;
 *   Caller, CheckFlags, PORF, IWDTRF, WDTRF, SWRF, LVD0RF, CWSF;
 *
 *   Caller => CheckFlags [label="internal_check_startup_flags()"];
 *   CheckFlags => PORF [label="internal_check_porf()"];
 *   PORF => CheckFlags [label="bool (info only)"];
 *   CheckFlags => IWDTRF [label="internal_check_iwdtrf()"];
 *   IWDTRF => CheckFlags [label="bool (critical)"];
 *   CheckFlags => CheckFlags [label="RX_ASSERT(iwdtrf_ok)"];
 *   CheckFlags => WDTRF [label="internal_check_wdtrf()"];
 *   WDTRF => CheckFlags [label="bool"];
 *   CheckFlags => SWRF [label="internal_check_swrf()"];
 *   SWRF => CheckFlags [label="bool"];
 *   CheckFlags => LVD0RF [label="internal_check_lvd0rf()"];
 *   LVD0RF => CheckFlags [label="bool"];
 *   CheckFlags => CWSF [label="internal_check_cwsf()"];
 *   CWSF => CheckFlags [label="bool (info only)"];
 *   CheckFlags => Caller [label="k_rx_ok or k_rx_err_hw_init_failed"];
 * }
 * @endmsc
 *
 * ## Performance (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | Register reads (6 flags) | ~2 us | 3 registers x 2 reads each |
 * | Validation logic | ~1 us | Boolean comparisons, assertions |
 * | Logging (if needed) | ~5 us | UART write for warnings |
 * | **Total (normal boot)** | **~3 us** | No warnings logged |
 * | **Total (with warnings)** | **~10 us** | Includes UART output |
 *
 * ## Example Reset Scenarios
 *
 * **Scenario 1: Normal power-on boot**
 * - PORF=1 (power-on reset detected) [PASS]
 * - IWDTRF=0 (no watchdog timeout) [PASS]
 * - WDTRF=0, SWRF=0, LVD0RF=0 (no other resets) [PASS]
 * - Result: k_rx_ok (boot continues)
 *
 * **Scenario 2: Warm boot (software reset)**
 * - PORF=0 (no power-on reset) [WARN] Info logged
 * - IWDTRF=0 (no watchdog timeout) [PASS]
 * - SWRF=1 (software reset detected) [WARN] Error returned
 * - Result: k_rx_err_hw_init_failed (caller handles)
 *
 * **Scenario 3: Firmware hung (IWDT timeout)**
 * - PORF=0 (no power-on reset) [WARN]
 * - IWDTRF=1 (watchdog timeout) [STOP] **CRITICAL**
 * - Result: RX_ASSERT halts execution (firmware bug detected)
 *
 * @return rx_err_t Status code indicating boot condition
 * @retval k_rx_ok All checks passed (normal boot or acceptable warm boot)
 * @retval k_rx_err_hw_init_failed Non-critical flag set (WDTRF, SWRF, or LVD0RF)
 *
 * @pre Reset status registers accessible (RSTSR0, RSTSR1, RSTSR2)
 * @pre Register protection unlocked (if needed for flag clearing)
 *
 * @post Critical flags validated (IWDTRF=0 or execution halted)
 * @post Non-critical flags logged if set
 * @post Caller informed of boot condition (k_rx_ok or error)
 *
 * @note **This function does NOT clear reset flags.** Flags persist until explicitly cleared
 *       by writing to RSTSR registers with protection unlocked (PRCR.PRC0=1).
 *
 * @warning **IWDTRF set always halts execution.** This indicates prior firmware failure
 *          (infinite loop, deadlock, missing watchdog refresh). Must fix root cause before boot.
 *
 * @par Thread Safety:
 * Executes before ThreadX starts (single-threaded context). No synchronization needed.
 *
 * @par Example Usage:
 * @code
 * // main.c boot sequence:
 * int main(void) {
 *   rx_err_t ret;
 *
 *   // Validate reset status flags
 *   ret = internal_check_startup_flags();
 *   RX_ERROR_CHECK(ret);
 *
 *   if (ret == k_rx_err_hw_init_failed) {
 *     // Non-critical error: log and continue (or halt if desired)
 *     rx_log_warn(s_tag, "Abnormal reset detected, continuing boot");
 *   }
 *
 *   // Continue with clock and hardware initialization
 *   ret = rx_clock_power_init();
 *   // ...
 * }
 * @endcode
 *
 * @see internal_check_porf() Check Power-On Reset Detect Flag (RSTSR0.0)
 * @see internal_check_iwdtrf() Check Independent Watchdog Timer Reset Flag (RSTSR2.1)
 * @see internal_check_wdtrf() Check Watchdog Timer Reset Flag (RSTSR2.0)
 * @see internal_check_swrf() Check Software Reset Flag (RSTSR2.2)
 * @see internal_check_lvd0rf() Check Voltage Monitoring Reset Flag (RSTSR0.1)
 * @see internal_check_cwsf() Check Cold/Warm Start Flag (RSTSR1.7)
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify all reset scenarios (power-on, warm boot, watchdog, brownout)
 */
static rx_err_t internal_check_startup_flags(void)
{
  /* Bring-up mode: NEVER halt on reset-cause flags.  All of PORF, IWDTRF,
   * WDTRF, SWRF, LVD0RF, CWSF are just read-and-ignored here; the full
   * diagnostic is still printed later via internal_report_startup_flags()
   * once uart_debug_init() has run.
   *
   * Rationale: the prior halt-on-abnormal-reset behaviour killed the
   * firmware silently on every rfp-cli flash (SWRF set) and on every
   * post-IWDT reboot (IWDTRF set), because the fatal-error handler
   * writes to UART which hasn't been initialised at this point in boot.
   * Result: board appears dead, Cypress CY7C65213 never sees any
   * telemetry bytes and may even de-enumerate from USB as the board
   * cycles through a reset loop.  Bench bring-up needs to see the
   * flags, not halt on them. */
  (void)internal_check_porf();
  (void)internal_check_iwdtrf();
  (void)internal_check_wdtrf();
  (void)internal_check_swrf();
  (void)internal_check_lvd0rf();
  (void)internal_check_cwsf();

