Locked-Inc/STAR/star-rx72n-firmware/src/main.c
/* =============================================================================
 * tx_application_define Helper Functions
 *
 * These static helpers decompose the ThreadX application callback into
 * single-responsibility units that each stay under ~60 lines
 * (NASA Power of 10 Rule 4).
 * =============================================================================
 */

/**
 * @brief Initialize the global bus manager with infrastructure interfaces
 *
 * @details
 * Creates the bus manager singleton that all tasks use to access hardware buses.
 * The bus manager requires a ThreadX mutex internally, so it must be initialized
 * inside tx_application_define (after the ThreadX kernel is ready but before
 * the scheduler starts).
 *
 * @pre rx_infrastructure_init() completed successfully in main()
 * @pre ThreadX kernel initialized (mutex creation available)
 *
 * @post g_bus_manager initialized and ready for rx_bus_manager_add_bus() calls
 * @post Infrastructure error and pin interfaces wired into the bus manager
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see rx_bus_manager_init() Underlying initialization function
 * @see internal_register_system_buses() Registers individual buses after this call
 *
 * @since Version 1.0.0
 */
static void internal_init_bus_manager(void)
{
  extern rx_bus_manager_t g_bus_manager;

  rx_error_interface_t* error_iface = rx_infrastructure_get_error_interface();
  rx_pin_interface_t*   pin_iface   = rx_infrastructure_get_pin_interface();

  rx_err_t err = rx_bus_manager_init(&g_bus_manager, "BUS_MGR", error_iface, pin_iface);
  RX_ASSERT(err == k_rx_ok, "rx_bus_manager_init must succeed");
}

/**
 * @brief Register all hardware buses (1-Wire, GPIO, ADC) with the bus manager
 *
 * @details
 * Initializes static bus configuration structs and registers them with the
 * global bus manager. Each bus is available to tasks via rx_bus_manager_get_interface().
 *
 * Registered buses:
 * - **onewire0** (P51): DS18B20 temperature sensor, 1-Wire bit-banging
 * - **gpio** (P00): Generic GPIO for motor driver control signals
 * - **motor0_current** (S12AD0, ch7, AN007, P47): Motor 0 (FL) IPROPI current sense
 * - **motor1_current** (S12AD0, ch6, AN006, P46): Motor 1 (FR) IPROPI current sense
 * - **motor2_current** (S12AD0, ch5, AN005, P45): Motor 2 (BL) IPROPI current sense
 * - **motor3_current** (S12AD0, ch4, AN004, P44): Motor 3 (BR) IPROPI current sense
 *
 * @pre internal_init_bus_manager() completed successfully
 * @pre Static bus config structs zeroed (BSS): s_onewire0_config, s_gpio_config,
 *      s_motor_current_configs[]
 *
 * @post All three buses registered and accessible via bus manager
 * @post Static config structs populated with bus parameters
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see internal_init_bus_manager() Must be called first
 * @see rx_bus_config_init_onewire() 1-Wire bus configuration
 * @see rx_bus_config_init_gpio() GPIO bus configuration
 * @see rx_bus_config_init_adc() ADC bus configuration
 *
 * @since Version 1.0.0
 */
static void internal_register_system_buses(void)
{
  extern rx_bus_manager_t g_bus_manager;

  /* Register onewire0 - DS18B20 Temperature Sensor */
  rx_err_t err = rx_bus_config_init_onewire(&s_onewire0_config,
                                            "onewire0", /* name */
                                            k_rx_p5_1); /* pin = P51 */
  RX_ASSERT(err == k_rx_ok, "onewire0 config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, &s_onewire0_config);
  RX_ASSERT(err == k_rx_ok, "onewire0 registration must succeed");

  /* Register gpio - Generic GPIO Access (initial pin P00) */
  err = rx_bus_config_init_gpio(&s_gpio_config,
                                "gpio",     /* name */
                                k_rx_p0_0); /* pin = P00 (generic bus) */
  RX_ASSERT(err == k_rx_ok, "gpio config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, &s_gpio_config);
  RX_ASSERT(err == k_rx_ok, "gpio registration must succeed");

  /* Register motor current-sense ADC channels (S12AD0, 12-bit, 4 motors) */
  for (uint8_t i = 0; i < k_motor_current_adc_count; i++) {
    err = rx_bus_config_init_adc(&s_motor_current_configs[i],
                                 g_motor_current_bus_names[i],    /* name (shared) */
                                 k_adc_unit_0,                    /* unit = S12AD0 */
                                 k_motor_current_adc_channels[i], /* channel = AN004-7 */
                                 k_adc_resolution_12bit);         /* bits = 12-bit */
    RX_ASSERT(err == k_rx_ok, "motor_current config init must succeed");
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_motor_current_configs[i]);
    RX_ASSERT(err == k_rx_ok, "motor_current registration must succeed");
    err = rx_bus_adc_init(&g_bus_manager, g_motor_current_bus_names[i]);
    RX_ASSERT(err == k_rx_ok, "motor_current ADC init must succeed");
  }

  /* Register i2c1_imu - BNO055 IMU (RIIC1, addr 0x28, SDA=P2.0, SCL=P2.1) */
  err = rx_bus_config_init_i2c(&s_i2c1_imu_config,
                               "i2c1_imu",              /* name: matches rx_bno055.c s_bus_name */
                               k_riic_channel_1,        /* channel: RIIC1 */
                               k_i2c_addr_bno055,       /* device_addr: BNO055 (COM3/ADR=LOW) */
                               k_rx_p2_0,               /* sda_pin: P2.0 = SDA1 */
                               k_rx_p2_1,               /* scl_pin: P2.1 = SCL1 */
                               k_i2c_frequency_400khz); /* frequency_hz: 400 kHz fast mode */
  RX_ASSERT(err == k_rx_ok, "i2c1_imu config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, &s_i2c1_imu_config);
  RX_ASSERT(err == k_rx_ok, "i2c1_imu registration must succeed");
  err = rx_bus_i2c_init(&g_bus_manager, "i2c1_imu");
  RX_ASSERT(err == k_rx_ok, "i2c1_imu I2C init must succeed");

