Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  (void)gpio_write_low(k_rx_pb_0);
  (void)gpio_write_high(k_rx_p7_1); /* D11: clock init done */

  /* ========================================================================
   * EARLY UART INITIALIZATION - Enable error logging ASAP
   * ======================================================================== */
  ret = uart_debug_init();

  /* Report startup flags to console (only if UART initialized successfully) */
  if (ret == k_rx_ok) {
    uart_debug_puts("\r\n=== STAR RX72N BOOT ===\r\n");
    internal_report_startup_flags();
    (void)gpio_write_low(k_rx_p7_1);
    (void)gpio_write_high(k_rx_p7_2); /* D12: UART init OK */
  }

  /* Now check UART init status - will halt if failed, but at least tried to report flags */
  RX_ERROR_CHECK(ret);

  /* Initialize infrastructure (error handler + pin validator) before peripherals.
   * Must run in single-threaded context before ThreadX starts. */
  ret = rx_infrastructure_init();
  RX_ERROR_CHECK(ret);

  /* Initialize application-specific hardware (GPIO, GPTW, timers, UART, SPI, I2C, ADC) */
  ret = hardware_init();
  RX_ERROR_CHECK(ret);

  (void)gpio_write_low(k_rx_p7_2);
  (void)gpio_write_high(k_rx_pb_1); /* D13: hardware_init done */

  /* Enable the nanopb wrapper so telemetry_task's rx_nanopb_encode_*()
   * and comm_task's rx_nanopb_decode_*() stop returning
   * k_rx_err_not_initialized (0x10F). The wrapper is a pure software
   * module with no hardware deps, so initialize it during the
   * pre-kernel single-threaded window next to the other module inits. */
  ret = rx_nanopb_init();
  RX_ERROR_CHECK(ret);

  {
    /* Inline USB0 bring-up sequence -- raw register pokes that mirror
     * libs/rx_usb/src/rx_usb_hw.c.  Kept inline (rather than inside
     * rx_usb_hw_init()) so the very first PRCR/MSTPCR/SYSCFG writes run
     * in the single-threaded pre-kernel window and the call to
     * rx_usb_hw_mark_initialized() below can safely tell rx_usb_init()
     * to skip its own redundant init pass.  See cherry-pick 0abb79c54. */
    volatile uint16_t* const PRCR_R    = (volatile uint16_t*)0x000803FEU;
    volatile uint32_t* const MSTPCRB_R = (volatile uint32_t*)0x00080014U;
    volatile uint16_t* const SYSCFG_R  = (volatile uint16_t*)0x000A0000U;
    volatile uint16_t* const INTENB0_R = (volatile uint16_t*)0x000A0030U;
    volatile uint16_t* const BRDYENB_R = (volatile uint16_t*)0x000A0036U;
    volatile uint16_t* const BEMPENB_R = (volatile uint16_t*)0x000A003AU;
    volatile uint16_t* const DCPCFG_R  = (volatile uint16_t*)0x000A005CU;
    volatile uint16_t* const DCPMAXP_R = (volatile uint16_t*)0x000A005EU;
    volatile uint16_t* const DCPCTR_R  = (volatile uint16_t*)0x000A0060U;

    *PRCR_R = 0xA503U;
    *MSTPCRB_R &= ~(1UL << 19);
    *PRCR_R = 0xA500U;

    /* HUM 40.3.1.1 ("Setting Data to the USB Related Register"):
     *   "Setting the SYSCFG.USBE bit to 1 AFTER starting the clock supply
     *    to the USB (SYSCFG.SCKE bit = 1) enables and starts USB operation."
     * The previous order (USBE then SCKE) silently no-ops half the SYSCFG
     * follow-on writes because the USB module clock is gated until SCKE=1
     * is acknowledged.  Required order: clear SYSCFG -> SCKE=1 -> wait ->
     * USBE=1.  DPRPU stays 0 here; it is asserted last (after pipe + ICU
     * config) to announce attach to the host. */
    *SYSCFG_R = 0x0000U;
    for (volatile uint32_t d = 0; d < 2400000U; d++) {
      __asm__ volatile("nop");
    }
    *SYSCFG_R |= (1U << 10); /* SCKE first per HUM 40.3.1.1 */
    for (volatile uint32_t d = 0; d < 2400000U; d++) {
      __asm__ volatile("nop");
    }
    *SYSCFG_R |= (1U << 0); /* USBE only after the clock is up */

    /* RX72N PHY housekeeping that mirrors rx_usb_hw.c's
     * internal_usb_configure_phy() -- must run between USBE=1 and
     * INTENB0 programming.  See tinyusb renesas/usba dcd_usba.c:626-628.
     *   - USB.DPUSR0R.FIXPHY0 cleared: release PHY from output-fixed state
     *   - USB0.PHYSLEW = 0x5     : RX72N-specific slew-rate trim */
    volatile uint32_t* const DPUSR0R_R = (volatile uint32_t*)0x000A0400U;
    volatile uint32_t* const PHYSLEW_R = (volatile uint32_t*)0x000A00F0U;
    *DPUSR0R_R &= ~(uint32_t)(1U << 4); /* FIXPHY0 */
    *PHYSLEW_R = 0x00000005U;           /* SLEWR00 | SLEWF00 */

    *DCPCFG_R  = 0x0000U;
    *DCPMAXP_R = 64U;
    *DCPCTR_R  = 0x0001U;
    *BRDYENB_R = 0x0001U;
    *BEMPENB_R = 0x0001U;
    *INTENB0_R = (uint16_t)((1U << 15) | (1U << 12) | (1U << 11) | (1U << 10) | (1U << 8));

    *SYSCFG_R |= (1U << 4); /* DPRPU */

    /* Enable CPU ICU delivery for USB0 USBI so BRDY/BEMP/CTRT interrupts
     * fire directly.  USBI0 is a Group-B software-configurable interrupt
     * on RX72N (HW manual Ch15 Table 15.3; hirakuni45/RX RX72N/icu.hpp
     * SELECTB::USBI0 = 62), so we must program SLIBR[144] = 62 before
     * IER/IPR/IR for vector 144 do anything.  See rx72n_usb_regs.h for
     * the full narrative -- earlier revisions used vector 36 (a
     * reserved gap), which silently consumed IER/IPR writes and left
     * the ISR dormant. */
    volatile uint8_t* const SLIBR144_R = (volatile uint8_t*)(0x00087700U + 144U);
    volatile uint8_t* const SLIPRCR_R  = (volatile uint8_t*)0x00087A00U;
    volatile uint8_t* const IPR144_R   = (volatile uint8_t*)(0x00087300U + 144U);
    volatile uint8_t* const IR144_R    = (volatile uint8_t*)(0x00087000U + 144U);
    volatile uint8_t* const IER18_R    = (volatile uint8_t*)(0x00087200U + 18U); /* 144 / 8 */

    /* HUM 15.7.7 "Setting Software Configurable Interrupts" -- mandatory
     * 9-step procedure.  Steps:
     *   (1) IER bit clear (POR default; we set later in step 9)
     *   (2) SLIBR144 = 62 (USBI0 source code)
     *   (5) SLIPRCR.WPRC = 1   <-- previously missing -> ISR never fired
     *   (6) confirm WPRC == 1
     *   (8) IR144 = 0          (edge-detected vector, clear stale request)
     *   (9) IER18.IEN0 = 1     (enable vector 144 delivery)
     *
     * Page 153: "After assigning software configurable interrupts,
     *  confirm that the WPRC bit is 1 BEFORE the corresponding interrupt
     *  request is generated."  This matches the
     *  usb0_isr_not_firing_blocker symptom exactly. */
    enum : uint8_t {
      k_inline_usbi0_sli_src  = 62U,   /* USBI0 source number per HUM Table 15.3 */
      k_inline_sliprcr_wprc   = 0x01U, /* SLIPRCR.WPRC: write-once latch */
      k_inline_usbi_priority  = 12U,   /* IPR144 priority for USBI0 */
      k_inline_ier18_usbi_bit = 0U,    /* IER18 bit 0 == vector 144 (144 % 8) */
    };
    enum : uint16_t {
      k_inline_sliprcr_poll_max = 1024U, /* Bounded poll for HUM 15.7.7 step (6) */
    };

    *SLIBR144_R = k_inline_usbi0_sli_src;
    *SLIPRCR_R  = k_inline_sliprcr_wprc;
    /* HUM 15.7.7 step (6) bounded confirmation: WPRC latches in 1-2 ICLK
     * cycles; cap the poll so the boot path never spins forever (NASA
     * P10 Rule 2).  If WPRC fails to latch the IER enable below is a
     * no-op -- the ISR-entry counter diagnostic catches that case. */
    for (uint16_t i = 0; i < k_inline_sliprcr_poll_max; i++) {
      if ((*SLIPRCR_R & k_inline_sliprcr_wprc) != 0U) {
        break;
      }
    }
    *IPR144_R = k_inline_usbi_priority;
    *IR144_R  = 0U;
    *IER18_R |= (uint8_t)(1U << k_inline_ier18_usbi_bit);

    /* Diagnostic: drive PB3 (P4 pad 2, MCU pin 82, silkscreen EN3D)
     * HIGH here in main BEFORE tx_kernel_enter.  usb_task later drives
     * it LOW.  AD2 DIO7 probe on P4 pad 2 thus shows:
     *   HIGH = firmware reached main init but usb_task hasn't run
     *   LOW  = usb_task ran and set PB3 low
     *   0x0  = neither wrote (probe/wiring issue) */
    volatile uint8_t* const pb_pdr  = (volatile uint8_t*)0x0008C00BU;
    volatile uint8_t* const pb_podr = (volatile uint8_t*)0x0008C02BU;
    volatile uint8_t* const pb_pmr  = (volatile uint8_t*)0x0008C06BU;
    *pb_pmr &= (uint8_t) ~(1U << 3);
    *pb_pdr |= (uint8_t)(1U << 3);
    *pb_podr |= (uint8_t)(1U << 3); /* HIGH */
  }

  /* Hardware is now fully attached by the inline sequence above.  Tell
   * the production rx_usb_hw layer that s_hw_initialized = true so
   * rx_usb_init below skips the redundant register sequence, then call
   * rx_usb_init() to set up ring buffers, CDC class state, and flip
   * s_usb.initialized = true.  Without this, rx_usb_write() early-exits
   * with k_rx_err_invalid_state and telemetry never reaches the host. */
  rx_usb_hw_mark_initialized();
  ret = rx_usb_init(nullptr);
  RX_ERROR_CHECK(ret);

  /* Start the ThreadX scheduler - should never return */
  tx_kernel_enter();

  /* Should never reach here, ThreadX scheduler failed to start if it does */
  while (1) {
    __asm__ volatile("wait"); /* Wait for sleep/idle */
  }

  /* Unreachable: ThreadX scheduler takes over before reaching this point.
   * If execution reaches here, the system is in an undefined state. */
  __builtin_unreachable();

  return k_main_ret_success;
}
